hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timera.c
        /* Set External port filter */
        WRITE_REG16(TMRAx->FCONR,
                    (pstcInit->u16TrigFilterState | pstcInit->u16TrigFilterClkDiv |
                     pstcInit->u16ClkAFilterState | pstcInit->u16ClkAFilterClkDiv |
                     pstcInit->u16ClkBFilterState | pstcInit->u16ClkBFilterClkDiv));

        /* Set hardware trigger event */
        WRITE_REG16(TMRAx->HCONR,
                    (pstcInit->u16HwStartCondition | pstcInit->u16HwStopCondition |
                     pstcInit->u16HwClearCondition));
        WRITE_REG16(TMRAx->HCUPR, pstcInit->u16HwUpCondition);
        WRITE_REG16(TMRAx->HCDOR, pstcInit->u16HwDownCondition);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timera_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_timera_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: TMRAx structure Initialize success
 *           - ErrorInvalidParameter: pstcInit == NULL
 */
en_result_t TIMERA_StructInit(stc_timera_init_t *pstcInit)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    if (NULL == pstcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcInit->u16PeriodVal = 0xFFFFu;
        pstcInit->u16CountDir = TIMERA_COUNT_UP;
        pstcInit->u16CountMode = TIMERA_SAWTOOTH_WAVE;
        pstcInit->u16ClkDiv = TIMERA_CLKDIV_DIV1;
        pstcInit->u16OverflowAction = TIMERA_OVERFLOW_COUNT;
        pstcInit->u16HwStartCondition = TIMERA_HWSTART_INVALID;
        pstcInit->u16HwStopCondition = TIMERA_HWSTOP_INVALID;
        pstcInit->u16HwClearCondition = TIMERA_HWCLEAR_INVALID;
        pstcInit->u16HwUpCondition = TIMERA_HWUP_INVALID;
        pstcInit->u16HwDownCondition = TIMERA_HWDOWN_INVALID;
        pstcInit->u16TrigFilterState = TIMERA_TRIG_FILTER_DISABLE;
        pstcInit->u16TrigFilterClkDiv = TIMERA_TRIG_CLKDIV_DIV1;
        pstcInit->u16ClkAFilterState = TIMERA_CLKA_FILTER_DISABLE;
        pstcInit->u16ClkAFilterClkDiv = TIMERA_CLKA_CLKDIV_DIV1;
        pstcInit->u16ClkBFilterState = TIMERA_CLKB_FILTER_DISABLE;
        pstcInit->u16ClkBFilterClkDiv = TIMERA_CLKB_CLKDIV_DIV1;
    }

    return enRet;
}

/**
 * @brief  Set the TimerA counter value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Value                Counter value (between 0 and 0xFFFF)
 * @retval None
 */
void TIMERA_SetCounter(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

    WRITE_REG16(TMRAx->CNTER, u16Value);
}

/**
 * @brief  Get the TimerA counter value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @retval uint16_t                     Counter value (between 0 and 0xFFFF)
 */
uint16_t TIMERA_GetCounter(M0P_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->CNTER);
}

/**
 * @brief  Set TimerA period register value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Value                Period value (between 0 and 0xFFFF)
 * @retval None
 */
void TIMERA_SetPeriod(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

    WRITE_REG16(TMRAx->PERAR, u16Value);
}

/**
 * @brief  Get TimerA period register value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @retval uint16_t                     Period value (between 0 and 0xFFFF)
 */
uint16_t TIMERA_GetPeriod(M0P_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->PERAR);
}

/**
 * @brief  Set TimerA clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Div                  TimerA clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_CLKDIV_DIV1:   HCLK
 *           @arg TIMERA_CLKDIV_DIV2:   HCLK/2
 *           @arg TIMERA_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERA_CLKDIV_DIV8:   HCLK/8
 *           @arg TIMERA_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERA_CLKDIV_DIV32:  HCLK/32
 *           @arg TIMERA_CLKDIV_DIV64:  HCLK/64
 *           @arg TIMERA_CLKDIV_DIV128: HCLK/128
 *           @arg TIMERA_CLKDIV_DIV256: HCLK/256
 *           @arg TIMERA_CLKDIV_DIV512: HCLK/512
 *           @arg TIMERA_CLKDIV_DIV1024:HCLK/1024
 * @retval None
 */
void TIMERA_SetClkDiv(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLK_DIV(u16Div));

    MODIFY_REG16(TMRAx->BCSTR, TMRA_BCSTR_CKDIV, u16Div);
}

/**
 * @brief  Enable or disable TimerA compare match or trigger capture event output.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16EvtSource            TimerA event source
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_EVENT_CMP1: Chanel 1 compare match or trigger capture
 *           @arg TIMERA_EVENT_CMP2: Chanel 2 compare match or trigger capture
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_EventCmd(M0P_TMRA_TypeDef *TMRAx, uint16_t u16EvtSource,
                     en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_EVENT(u16EvtSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

