hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timera.c
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCB);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCB);
    }
}

/**
 * @brief  Set TimerA hardware trigger counter Start/Stop/Clear condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Condition            TimerA hardware start counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg @ref TIMERA_Hardware_Start_Count_Condition
 *           @arg @ref TIMERA_Hardware_Stop_Count_Condition
 *           @arg @ref TIMERA_Hardware_Clear_Count_Condition
 * @retval  None
 */
void TIMERA_SetHwTriggerCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWTRIGGER_CONDITION(u16Condition));

    WRITE_REG16(TMRAx->HCONR, u16Condition);
}

/**
 * @brief  Get TimerA hardware trigger counter Start/Stop/Clear condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @retval Returned value can be one or any combination of the following values:
 *           @arg @ref TIMERA_Hardware_Start_Count_Condition
 *           @arg @ref TIMERA_Hardware_Stop_Count_Condition
 *           @arg @ref TIMERA_Hardware_Clear_Count_Condition
 */
uint16_t TIMERA_GetHwTriggerCondition(M0P_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->HCONR);
}

/**
 * @brief  Set TimerA hardware start counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Condition            TimerA hardware start counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWSTART_INVALID:       Hardware start is invalid
 *           @arg TIMERA_HWSTART_TRIG_RISING:   Hardware start counter by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTART_TRIG_FALLING:  Hardware start counter by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTART_SPECIFY_EVT:   Hardware start counter by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwStartCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWSTART_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->HCONR, TIMERA_HCONR_HSTA_MASK, u16Condition);
}

/**
 * @brief  Set TimerA hardware stop counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Condition            TimerA hardware stop counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWSTOP_INVALID:        Hardware stop is invalid
 *           @arg TIMERA_HWSTOP_TRIG_RISING:    Hardware stop counter by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTOP_TRIG_FALLING:   Hardware stop counter by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTOP_SPECIFY_EVT:    Hardware stop counter by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwStopCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWSTOP_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->HCONR, TIMERA_HCONR_HSTP_MASK, u16Condition);
}

/**
 * @brief  Set TimerA hardware clear counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Condition            TimerA hardware clear counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWCLEAR_INVALID:       Hardware clear is invalid
 *           @arg TIMERA_HWCLEAR_TRIG_RISING:   Hardware clear counter by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWCLEAR_TRIG_FALLING:  Hardware clear counter by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWCLEAR_SPECIFY_EVT:   Hardware clear counter by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwClearCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWCLEAR_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->HCONR, TIMERA_HCONR_HCLE_MASK, u16Condition);
}

/**
 * @brief  Set TimerA hardware up counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u16Condition            TimerA hardware up counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWUP_INVALID:                  Hardware count up is invalid
 *           @arg TIMERA_HWUP_CLKA_LOW_CLKB_RISING:     Hardware count up by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWUP_CLKA_LOW_CLKB_FALLING:    Hardware count up by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWUP_CLKA_HIGH_CLKB_RISING:    Hardware count up by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWUP_CLKA_HIGH_CLKB_FALLING:   Hardware count up by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWUP_CLKB_LOW_CLKA_RISING:     Hardware count up by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWUP_CLKB_LOW_CLKA_FALLING:    Hardware count up by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWUP_CLKB_HIGH_CLKA_RISING:    Hardware count up by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWUP_CLKB_HIGH_CLKA_FALLING:   Hardware count up by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWUP_TRIG_RISING:              Hardware count up by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWUP_TRIG_FALLING:             Hardware count up by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWUP_SPECIFY_EVT:              Hardware count up by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwUpCondition(M0P_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWUP_CONDITION(u16Condition));

