hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timera.c
    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(*TMRA_PCONR, TMRA_PCONR1_OUTEN);
    }
    else
    {
        CLEAR_REG16_BIT(*TMRA_PCONR, TMRA_PCONR1_OUTEN);
    }
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity when start count.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_STARTCOUNT_OUTPUT_LOW:  TIMA_<t>_PWMn output low level when TimerA start count
 *           @arg TIMERA_OC_STARTCOUNT_OUTPUT_HIGH: TIMA_<t>_PWMn output high level when TimerA start count
 *           @arg TIMERA_OC_STARTCOUNT_OUTPUT_HOLD: TIMA_<t>_PWMn output hold level when TimerA start count
 * @retval None
 */
void TIMERA_OC_SetStartCountOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                           uint8_t u8Channel,
                                           uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_START_COUNT_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR1_STAC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for stop count.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_STOPCOUNT_OUTPUT_LOW:   TIMA_<t>_PWMn output low level when TimerA stop count
 *           @arg TIMERA_OC_STOPCOUNT_OUTPUT_HIGH:  TIMA_<t>_PWMn output high level when TimerA stop count
 *           @arg TIMERA_OC_STOPCOUNT_OUTPUT_HOLD:  TIMA_<t>_PWMn output hold level when TimerA stop count
 * @retval None
 */
void TIMERA_OC_SetStopCountOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                          uint8_t u8Channel,
                                          uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_STOP_COUNT_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR1_STPC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for compare match.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_LOW:        TIMA_<t>_PWMn output low level when TimerA comapre match
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_HIGH:       TIMA_<t>_PWMn output high level when TimerA comapre match
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_HOLD:       TIMA_<t>_PWMn output hold level when TimerA comapre match
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_INVERTED:   TIMA_<t>_PWMn output inverted level when TimerA comapre match
 * @retval None
 */
void TIMERA_OC_SetCmpMatchOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                         uint8_t u8Channel,
                                         uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_CMPMATCH_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR1_CMPC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for period match.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRA:             TimerA unit 1 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_LOW:         TIMA_<t>_PWMn output low level when TimerA period match
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_HIGH:        TIMA_<t>_PWMn output high level when TimerA period match
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_HOLD:        TIMA_<t>_PWMn output hold level when TimerA period match
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_INVERTED:    TIMA_<t>_PWMn output inverted level when TimerA period match
 * @retval None
 */
void TIMERA_OC_SetPeriodMatchOutputPolarity(M0P_TMRA_TypeDef *TMRAx,
                                            uint8_t u8Channel,
                                            uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_PERIODMATCH_OUTPUT_POLARITY(u16Polarity));

